{
    "aaron-turner": {
        "name": "Aaron Turner",
        "location": "Los Angeles, CA",
        "company": "Wasmer",
        "twitter": "torch2424",
        "avatar": "aaron-turner.png",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "Building for Budgets",
        "synopsis": "A personal story of living in a low income family with tips on how modern web technologies, like WebAssembly and Web Workers, can bring new experiences to the web for budget devices that struggled to run these experiences before."
    },
    "daria-caraway": {
        "name": "Daria Caraway",
        "location": "Denver, CO",
        "company": "Workday",
        "twitter": "darcar31",
        "avatar": "daria-caraway.jpg",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "How to Have an Amicable Breakup With A JavaScript Library",
        "synopsis": "Choosing a JavaScript library is a lot like dating: the longer you commit yourself, the messier it is when you decide to break up.  Whether something better comes along, or the library is deprecated, changing a dependency often requires a lot of time or leaves the code in a less attractive state. In this talk you will learn some techniques that will help ease the pain of this situation."
    },
    "ej-mason": {
        "name": "E.J. Mason",
        "location": "Los Angeles, CA",
        "company": "Pearson",
        "twitter": "codeability",
        "avatar": "ej-mason.jpg",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "Accessibility is a Hydra",
        "synopsis": "When Hercules fought the hydra, its heads would grow back no matter how many times he cut them off. Web accessibility professionals put repeated effort toward fighting accessibility barriers, and often feel like their work is never done. If we want to prevail against accessibility barriers, we have to understand our own hydra: we have to talk about ableism."
    },
    "ginger-chien": {
        "name": "Ginger Chien",
        "location": "Seattle, WA",
        "company": "AT&T",
        "twitter": "spacepupster",
        "avatar": "ginger-chien.jpg",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "How to Succeed with Inclusion Initiatives",
        "synopsis": "Leadership and staff must take intentional, self-aware personal risks to steer workplace culture toward inclusion and its economic benefits. This requires permission and a moral directive from the top to create space, incentivizing management to role model vulnerable and remarkable behaviors, giving employees opportunities to participate in and create their own inclusion activities that involve discovery and testing of personal comfort zones, and to openly reward successes."
    },
    "isabela-moreira": {
        "name": "Isabela Moreira",
        "location": "Seattle, WA",
        "company": "Cedar AI",
        "twitter": "isabelacmor",
        "avatar": "isabela-moreira.jpg",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "Making Reusable SVGs with React",
        "synopsis": "Learn how to merge your creative side with your coding side in this live-coding talk! Leveraging the practice of reusable code and React components, we’ll create SVG images and animations that can be extended, adapted, and reused throughout your app. See how a few tweaks and props injected into your standard SVG code can give you the power of composable and reusable components!"
    },
    "jasper-schulte": {
        "name": "Jasper Schulte",
        "location": "Amsterdam, NE",
        "company": "GreenHome",
        "twitter": "zjaaspoer",
        "avatar": "jasper-schulte.jpg",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "Controlling a Swarm of Drones with JavaScript",
        "synopsis": "We're pretty used to drones flying around us by now. Until now most of these drones were still controlled by a human operator. But what if we could control them solely using our code? In this talk I will show how to control multiple drones using JavaScript. With the help of Node.js we'll send commands to the drones and read back their telemetry. I will talk about the difficulties of flying and keeping control of a drone completely without human interference. At the end we will actually have a small swarm of drones flying on stage!"
    },
    "kinuko-yasuda": {
        "name": "Kinuko Yasuda",
        "location": "Tokyo, JP",
        "company": "Google",
        "twitter": "kinu",
        "avatar": "kinuko-yasuda.jpg",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "Portable, distributable web content with Web Packaging",
        "synopsis": "The Chrome Loading team has been tackling various \"page loading\" problems. From optimizing the networking and loading stack, to helping web developers make their site's experience better with new powerful web platform features, we strive for enabling delightful user experiences on the web. In this talk I'd like to talk about one of those new features, which is called \"Web Packaging\".  Web Packaging is a set of proposals that allows web content to be digitally signed and packaged, so that the content can become \"portable\", i.e. it can not only be retrieved from the original publisher's site, but also via a fast cache, over p2p protocol, via an SD card, or virtually anything you can think of.  We believe this can increase the availability of web content for a wider audience, even where internet connectivity isn't always available!"
    },
    "claudius-mbemba": {
        "name": "Claudius Mbemba",
        "location": "Seattle, WA",
        "company": "Neu",
        "twitter": "mbembaships",
        "avatar": "claudius-mbemba.jpg",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "Scalable Distributed Messaging with Kafka on K8",
        "synopsis": "Kafka is a production-ready, scalable, distributed streaming platform that's being used by top companies around the world. Learn how you can turn Kafka into a powerful pub-sub mechanism for your own projects."
    },
    "saimon-sharif": {
        "name": "Saimon Sharif",
        "location": "New York, NY",
        "company": "Attune",
        "twitter": "saimonsharif",
        "avatar": "saimon-sharif.jpg",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "Refactoring JavaScript using JavaScript",
        "synopsis": "With codemods, engineers can programmatically refactor their code, saving hundreds of hours while reducing tech debt. I'll share my love, struggles, and successes applying them in a large codebase. We'll see my favorite codemods along with tips on how to use them effectively, and also write one from scratch!"
    },
    "charlie-gerard": {
        "name": "Charlie Gerard",
        "location": "Sydney, AU",
        "company": "Atlassian",
        "twitter": "devdevcharlie",
        "avatar": "charlie-gerard.jpg",
        "bio": "this is the bio",
        "url": "https://website.domain",
        "talk": "Machine Learning for Front-End Devs",
        "synopsis": "Machine learning can have some pretty complicated concepts to grasp if you’re not a data scientist. However, recent developments in tooling make it more and more accessible for developers and people with little or no experience. In this presentation, we will talk about the different applications, possibilities, tools and resources, as well as show a few examples and demos, so you can get started building your own experiments using machine learning in JavaScript."
    }
}
