[
  {
    "id": "aaron-turner",
    "name": "Aaron Marquice Turner",
    "location": "Los Angeles, CA",
    "talkTitle": "Building for Budgets",
    "reveal": "2019-08-20T10:00:00-07:00",
    "topic": "Web Assembly",
    "email": "aaron@aaronthedev.com",
    "pronouns": [],
    "twitter": "torch2424",
    "company": "Wasmer",
    "track": "main",
    "abstract": "A personal story of living in a low income family. With tips on how modern web technologies, like WebAssembly and Web Workers, can bring new experiences to the web for budget devices that struggled to run these experiences before.",
    "pixelated": "adb5ce83ce033ab83db8f924eaa52143885581d7.png"
  },
  {
    "id": "daria-caraway",
    "name": "Daria Caraway",
    "location": "Denver, CO",
    "talkTitle": "How to Have an Amicable Breakup With A JavaScript Library",
    "reveal": "2019-08-21T10:00:00-07:00",
    "topic": "Open Source",
    "email": "dacaraway@gmail.com",
    "pronouns": [],
    "twitter": "darcar31",
    "company": "Workday",
    "track": "main",
    "abstract": "Choosing a JavaScript library is a lot like dating: the longer you commit yourself, the messier it is when you decide to break up.  Whether something better comes along, or the library is deprecated, changing a dependency often requires a lot of time or leaves the code in a less attractive state. In this talk you will learn some techniques that will help ease the pain of this situation.",
    "pixelated": "811b56ac3b4fcf9b684b26f65218f085c22b5836.png"
  },
  {
    "id": "ej-mason",
    "name": "EJ Mason",
    "location": "Los Angeles, CA",
    "talkTitle": "Accessibility is a Hydra",
    "reveal": "2019-08-21T14:00:00-07:00",
    "topic": "Accessibility",
    "email": "eliasjmason@gmail.com",
    "pronouns": [],
    "twitter": "codeability",
    "company": "Pearson",
    "track": "main",
    "abstract": "When Hercules fought the hydra, its heads would grow back no matter how many times he cut them off. Web accessibility professionals put repeated effort toward fighting accessibility barriers, and often feel like their work is never done. If we want to prevail against accessibility barriers, we have to understand our own hydra: we have to talk about ableism.",
    "pixelated": "7a14764d8b7407191cd95d4ad006e1c4049bbb97.png"
  },
  {
    "id": "ginger-chien",
    "name": "Ginger Chien",
    "location": "Seattle, WA",
    "talkTitle": "How to Succeed with Inclusion Initiatives",
    "reveal": "2019-08-22T10:00:00-07:00",
    "topic": "Tech Calture",
    "email": "spacepupster@gmail.com",
    "pronouns": [],
    "twitter": "spacepupster",
    "company": "AT&T",
    "track": "main",
    "abstract": "Leadership and staff must take intentional, self-aware personal risks to steer workplace culture toward inclusion and its economic benefits. This requires permission and a moral directive from the top to create space, incentivizing management to role model vulnerable and remarkable behaviors, giving employees opportunities to participate in and create their own inclusion activities that involve discovery and testing of personal comfort zones, and to openly reward successes.",
    "pixelated": "2c41606bf59ed2b9ef12d979e89749160afa544a.png"
  },
  {
    "id": "isabela-moreira",
    "name": "Isabela Moreira",
    "location": "Seattle, WA",
    "talkTitle": "Making Reusable SVGs with React",
    "reveal": "2019-08-22T14:00:00-07:00",
    "topic": "SVG",
    "email": "isabela.cmor@gmail.com",
    "pronouns": [],
    "twitter": "isabelacmor",
    "company": "Cedar AI",
    "track": "main",
    "abstract": "Learn how to merge your creative side with your coding side in this live-coding talk! Leveraging the practice of reusable code and React components, we’ll create SVG images and animations that can be extended, adapted, and reused throughout your app. See how a few tweaks and props injected into your standard SVG code can give you the power of composable and reusable components!",
    "pixelated": "e23f82e06f776b24c295d68896fa4a12cf1f4c9a.png"
  }
]